#### Terraform Validation & Plan Results
* Terraform Version 📎`1.10.4`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].time_rotating.rotating_current: Refreshing state... [id=2025-01-20T11:38:28Z][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_developer[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_admin: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_reader[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_network_connectivity_config.network_connectivity_config: Refreshing state... [id=515f13c1-53bb-48fb-a2c9-75e3f5d943f5/6a98de6f-849c-433d-9231-729c6cbbbf51][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_developer[0]: Read complete after 2s [id=66271379238954][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_admin: Read complete after 2s [id=408985471222074][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.databricks_group.group_reader[0]: Read complete after 2s [id=439960392122911][0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fr"].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_location.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_subscription.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_storage: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fr"].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_resource_group.resource_group_app_monitoring: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_engineering: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_consumption: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_resource_group.resource_group_app: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_access_connector_engineering.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-core-int-eng-dbac001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_subscription.current: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_monitor_action_group.monitor_action_group: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Insights/actionGroups/mydlz01-dptest-prd-ag001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal_databricks: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_admin: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal: Read complete after 1s [id=/servicePrincipals/e73816f4-d36e-4271-8f9b-ad2752bdbfaf][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.azuread_service_principal.service_principal: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_location.current: Read complete after 2s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/locations/northeurope][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_reader[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_developer[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal_databricks: Read complete after 1s [id=/servicePrincipals/7f7c7b4a-704d-4531-b73e-45e16b388271][0m
[0m[1mmodule.data_landing_zone.module.platform.azapi_update_resource.virtual_network: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].data.azuread_service_principal.service_principal: Read complete after 1s [id=/servicePrincipals/e73816f4-d36e-4271-8f9b-ad2752bdbfaf][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/c8f2627d-e6d3-376d-a637-6aab742b7c9d][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_admin: Read complete after 2s [id=/groups/f3776135-9227-43a1-a4bd-b786a82878fc][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_cognitive_services_usages_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Authorization/roleAssignments/2818ae17-0587-72bc-f5b1-f6e7f51eebe1][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_reader[0]: Read complete after 2s [id=/groups/46a9f467-c63d-4a24-8de9-bb148135bec5][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/53a18674-36db-f2f6-9b6a-2474dfc8dc8b][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_developer[0]: Read complete after 2s [id=/groups/fd3a6a34-8e7c-4315-803a-eedba0cc4b83][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_monitor_activity_log_alert.monitor_activity_log_alert_service_health: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Insights/activityLogAlerts/mydlz01-dptest-prd-alert-servicehealth][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_consumption_budget_subscription.consumption_budget_subscription: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Consumption/budgets/mydlz01-dptest-prd-bdgt][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_access_connector_consumption.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-core-int-cnsmptn-dbac001][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_service_principal.service_principal: Refreshing state... [id=8089508589893950][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_cognitive_services_usages_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Authorization/roleAssignments/80ab5bab-f728-9fb0-46ce-2d4f28bf57be][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/c369b603-a3ea-5e08-c619-c81cb93f0c23][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/c09b3996-eca7-2b53-5045-20a3e8bebd2f][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/0afb314a-01f6-749e-4b7e-8b0aff718a78][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/4ffe4565-aed9-1ee1-0c0d-09115773346a][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/70abdf0a-d422-ef72-358b-d2cc1b598a06][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/c42b5f95-e6b4-f1ad-045a-3573e766058d][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.databricks_access_connector.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-dptest-prd-dbac001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fr"].azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fr-kv001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/providers/Microsoft.Authorization/roleAssignments/65839ec0-de70-423f-03e7-721090c3831d][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/providers/Microsoft.Authorization/roleAssignments/8aef279e-8500-0d7a-a03a-a93ce11809e5][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/providers/Microsoft.Authorization/roleAssignments/96956bbf-bdf9-5ac3-5f00-d8cd27d8fb79][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/providers/Microsoft.Authorization/roleAssignments/b48b69ef-0ab4-1177-7078-41c72902f8e2][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/providers/Microsoft.Authorization/roleAssignments/13e25d35-30f7-0e12-e47d-5dcdd095e0b7][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fr"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/b7451604-7446-45d0-aaa0-a75e796d5fbb][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_key_vault_secrets_user_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/9755c69c-ef71-aff4-2724-3986739a850a][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_key_vault_secrets_officer_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/e1ec0fb5-214f-e26c-6592-ff8f22dfd63d][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.databricksresourceprovider_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/fc246de5-5b2e-9fbf-b525-f2723a97877f][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_key_vault_secrets_officer_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/ef5f5ad7-e4d9-e7e2-adb5-f4da42ffaa4b][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgenr-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fr"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fr-kv001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgenr-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgwks-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgwks-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgcur-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgcur-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgraw-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgraw-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgext-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgext-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fr"].azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dptest-prd-fr-kv001-account-pe][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dptest-prd-kv001-vault-pe][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_workspace_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/providers/Microsoft.Authorization/roleAssignments/aa1c2c54-0074-7417-e5ca-3f449699e319][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_raw: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/c8c697c9-1d22-2503-4492-8ec137c4e52b][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_curated_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/providers/Microsoft.Authorization/roleAssignments/d34c6268-97d6-fe80-3020-912bc2139e1c][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_raw_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/providers/Microsoft.Authorization/roleAssignments/db7cc64f-2342-29e0-e8d3-7e55ed45789a][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_external_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/providers/Microsoft.Authorization/roleAssignments/951a6e5c-0cf7-978e-b2b2-76abcb445495][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/2fa22893-19e1-6c21-1923-8e4fb231dbbf][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_external: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_enriched: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/a37c6b78-6584-7c35-50ea-675afe407495][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/b1bea90b-83db-611a-0bf8-d6fa607d9f73][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_enriched_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/providers/Microsoft.Authorization/roleAssignments/46f19989-9a15-2fc2-9204-66133bae7722][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_curated: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-cnsmptn-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-20T11:43:43Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-20T11:41:37Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-external-blob"]: Refreshing state... [id=6a98de6f-849c-433d-9231-729c6cbbbf51/4a58baf3-60ba-416d-8891-fd4486a50a97][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-workspace-dfs"]: Refreshing state... [id=6a98de6f-849c-433d-9231-729c6cbbbf51/7e808b60-9603-403e-9a95-7878a3e1db16][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-workspace-blob"]: Refreshing state... [id=6a98de6f-849c-433d-9231-729c6cbbbf51/6cedcef8-a8f7-4b0d-8623-79bc27e6fcae][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-enriched-blob"]: Refreshing state... [id=6a98de6f-849c-433d-9231-729c6cbbbf51/2700a0ce-dd8c-4268-9111-067f5f03be83][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-external-dfs"]: Refreshing state... [id=6a98de6f-849c-433d-9231-729c6cbbbf51/45abf07e-d91b-4e2d-b020-691b16645d2f][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-raw-dfs"]: Refreshing state... [id=6a98de6f-849c-433d-9231-729c6cbbbf51/6f5e8cf7-0ad2-4f5b-af85-fc11cf1911a8][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-raw-blob"]: Refreshing state... [id=6a98de6f-849c-433d-9231-729c6cbbbf51/b1565577-a9ad-436f-bcce-b8da63a3d204][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-curated-blob"]: Refreshing state... [id=6a98de6f-849c-433d-9231-729c6cbbbf51/b914c047-85dd-499a-8e3d-a07b5809a6a8][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-curated-dfs"]: Refreshing state... [id=6a98de6f-849c-433d-9231-729c6cbbbf51/565dc496-5954-4e2b-bfba-8f02c20194ff][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-enriched-dfs"]: Refreshing state... [id=6a98de6f-849c-433d-9231-729c6cbbbf51/0c4f39aa-18d2-485d-b8f6-daf41115e23d][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-20T11:41:56Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/fe64f45f-fa6b-e311-17dc-8765ccfc068a][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_raw_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/e30890fe-b1aa-7717-a709-f69c83701527][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/0b27c5e8-6b0d-7ee1-a164-9639b16a6bf0][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/dce32ed3-e822-79dc-0bcc-c29106e62e9a][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/f1207f9d-4c62-dcf5-7b8e-aa78ef6fc936][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-20T11:41:38Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/1bd02ffc-bb46-4dba-5002-87485c7f7e53][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/f8001df5-acc9-65cb-1ed4-ab5bafd2b9d8][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_workspace_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/36f171b5-a3d6-0d9f-32e0-8ad55cc328c4][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/aeb9737f-7a2b-cf58-bb67-4ab46e7d9444][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/86321c30-dd8d-27d0-bb11-7fbcaceff6f9][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-20T11:42:24Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fr"].time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-20T11:43:39Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_external_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/33c54106-fd68-d00d-6989-7321f39ef74a][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/42291221-d586-94af-3a7a-d9f34a41351b][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/1747f902-a260-be11-0e90-89df6e9735d3][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/c2672019-a690-a34a-79b5-3698d12ab2d9][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/bf6704b7-092c-6a56-06ec-696ab6de2546][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/b397e85a-527a-36ab-f830-4393b6b3818d][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/7e36597a-8943-ba5c-e9c3-e98b80d8d2d2][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_enriched_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/c7e31231-d8de-b744-244b-31b41b82c638][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/38adc5eb-c0bb-5521-eb28-4be2ad6c39cd][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/6491703f-66e1-6ccc-4ec8-229b8e762765][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/11d4eb32-8b8d-8a71-4ffc-308706bebd5f][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_curated_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/993100ec-f783-6dae-c8eb-3a5066dcf174][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/e2bc14f6-3d6f-62cf-6bd7-570212ab2439][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/d228746b-d212-cbf4-7fcd-c03808710dd9][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/61efe50d-110a-8918-720b-fe73b8590adc][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-20T11:41:36Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-raw-dfs"]: Refreshing state... [id=6108739024916677490][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-external-blob"]: Refreshing state... [id=4644344627921564515][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-enriched-blob"]: Refreshing state... [id=5347198753332773675][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-curated-dfs"]: Refreshing state... [id=201388907034576310][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-raw-blob"]: Refreshing state... [id=2301620223051676674][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-enriched-dfs"]: Refreshing state... [id=8179776976537977473][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-workspace-blob"]: Refreshing state... [id=5684383292568389177][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-external-dfs"]: Refreshing state... [id=8908206678223540587][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-workspace-dfs"]: Refreshing state... [id=8710588476982302791][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.null_resource.ncc_private_endpoint_rule_approval["storage-account-curated-blob"]: Refreshing state... [id=1668924624745165375][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_ai_service_service_principal["fr"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fr-kv001/providers/Microsoft.Authorization/roleAssignments/b717f4fa-cdf1-b0f9-7e52-616b51876a0a][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_ai_service_developer["fr"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fr-kv001/providers/Microsoft.Authorization/roleAssignments/465743d7-3c78-a5cf-16c3-39b84754f36d][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_ai_service_admin["fr"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fr-kv001/providers/Microsoft.Authorization/roleAssignments/7944ab8e-f693-8525-da3c-63a4ee71b79e][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-cnsmptn-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-20T11:45:58Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-20T11:46:42Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/dd5ff0c3-74df-4346-09f8-e47142fd6c6d][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/919c3698-f66b-982c-77f2-49aa619d93b1][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/c5d8d35c-e785-2e85-32a4-2fa04be60111][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/809bb16d-4b17-efc0-d1ca-fb2c2f702462][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_binding.ncc_binding["consumption"]: Refreshing state... [id=2224580392857435/6a98de6f-849c-433d-9231-729c6cbbbf51][0m
[0m[1mmodule.data_landing_zone.module.databricks_account_configuration.databricks_mws_ncc_binding.ncc_binding["engineering"]: Refreshing state... [id=2257550158632022/6a98de6f-849c-433d-9231-729c6cbbbf51][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_budget.budget[0]: Refreshing state... [id=515f13c1-53bb-48fb-a2c9-75e3f5d943f5|b7e23603-dc91-46de-a5ee-f5c10081b09a][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permission_assignment.permission_assignment_service_principal: Refreshing state... [id=8089508589893950][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permission_assignment.permission_assignment_reader[0]: Refreshing state... [id=439960392122911][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["marketplace"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|marketplace][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_workspace_conf.workspace_conf: Refreshing state... [id=_][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["serving"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|serving][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["compute"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|compute][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["access"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|access][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["lakeflow"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|lakeflow][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["storage"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|storage][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permission_assignment.permission_assignment_developer[0]: Refreshing state... [id=66271379238954][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["query"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|query][0m
[0m[1mmodule.data_landing_zone.module.databricks_workspace_configuration.databricks_system_schema.system_schema["billing"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|billing][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_cluster_policy.cluster_policy["DltComputePolicyPtt"]: Refreshing state... [id=0003A319D0197D21][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_cluster_policy.cluster_policy["PersonalComputePolicyPtt"]: Refreshing state... [id=0008C085051EFEDD][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_directory.directory: Refreshing state... [id=/mydlz01-dptest-int][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_cluster_policy.cluster_policy["JobComputePolicyPtt"]: Refreshing state... [id=0008A8A232782ACA][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_secret_scope.secret_scope: Refreshing state... [id=mydlz01-dptest-int-secret-scope][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_storage_credential.storage_credential: Refreshing state... [id=mydlz01-dptest-int-cred][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_secret_acl.secret_acl_service_principal: Refreshing state... [id=mydlz01-dptest-int-secret-scope|||99018e64-8a65-4af9-9d1e-f7a83c0aa8f0][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_secret_acl.secret_acl_developer[0]: Refreshing state... [id=mydlz01-dptest-int-secret-scope|||app001-developer][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_storage_credential_service_principal: Refreshing state... [id=storage_credential/mydlz01-dptest-int-cred/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_storage_credential_developer[0]: Refreshing state... [id=storage_credential/mydlz01-dptest-int-cred/app001-developer][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_storage_credential_admin: Refreshing state... [id=storage_credential/mydlz01-dptest-int-cred/app001-admin][0m
[0m[1mmodule.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_storage_credential_reader[0]: Refreshing state... [id=storage_credential/mydlz01-dptest-int-cred/app001-reader][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_catalog.catalog_external[0m will be created
[0m  [32m+[0m[0m resource "databricks_catalog" "catalog_external" {
      [32m+[0m[0m comment                        = "Data Applicaton Catalog - dptest - External"
      [32m+[0m[0m enable_predictive_optimization = "DISABLE"
      [32m+[0m[0m force_destroy                  = true
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m isolation_mode                 = "OPEN"
      [32m+[0m[0m metastore_id                   = (known after apply)
      [32m+[0m[0m name                           = "mydlz01-dptest-int"
      [32m+[0m[0m owner                          = (known after apply)
      [32m+[0m[0m properties                     = {
          [32m+[0m[0m "app_name"    = "dptest"
          [32m+[0m[0m "costCenter"  = "ABCD1234"
          [32m+[0m[0m "environment" = "int"
          [32m+[0m[0m "location"    = "northeurope"
          [32m+[0m[0m "use"         = "external"
        }
      [32m+[0m[0m storage_root                   = "abfss://mydlz01-dptest-prd-cur@mydlz01coreintstgcur.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_catalog.catalog_internal[0m will be created
[0m  [32m+[0m[0m resource "databricks_catalog" "catalog_internal" {
      [32m+[0m[0m comment                        = "Data Applicaton Catalog - dptest - Internal"
      [32m+[0m[0m enable_predictive_optimization = "DISABLE"
      [32m+[0m[0m force_destroy                  = true
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m isolation_mode                 = "ISOLATED"
      [32m+[0m[0m metastore_id                   = (known after apply)
      [32m+[0m[0m name                           = "mydlz01-dptest-int-int"
      [32m+[0m[0m owner                          = (known after apply)
      [32m+[0m[0m properties                     = {
          [32m+[0m[0m "app_name"    = "dptest"
          [32m+[0m[0m "costCenter"  = "ABCD1234"
          [32m+[0m[0m "environment" = "int"
          [32m+[0m[0m "location"    = "northeurope"
          [32m+[0m[0m "use"         = "internal"
        }
      [32m+[0m[0m storage_root                   = "abfss://mydlz01-dptest-prd-cur@mydlz01coreintstgcur.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_curated[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_curated" {
      [32m+[0m[0m browse_only     = (known after apply)
      [32m+[0m[0m comment         = "Default curated storage layer for 'dptest' data application."
      [32m+[0m[0m created_at      = (known after apply)
      [32m+[0m[0m created_by      = (known after apply)
      [32m+[0m[0m credential_id   = (known after apply)
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m fallback        = false
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-cur"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m updated_at      = (known after apply)
      [32m+[0m[0m updated_by      = (known after apply)
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-cur@mydlz01coreintstgcur.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_enriched[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_enriched" {
      [32m+[0m[0m browse_only     = (known after apply)
      [32m+[0m[0m comment         = "Default enriched storage layer for 'dptest' data application."
      [32m+[0m[0m created_at      = (known after apply)
      [32m+[0m[0m created_by      = (known after apply)
      [32m+[0m[0m credential_id   = (known after apply)
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m fallback        = false
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-enr"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m updated_at      = (known after apply)
      [32m+[0m[0m updated_by      = (known after apply)
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-enr@mydlz01coreintstgenr.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_external[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_external" {
      [32m+[0m[0m browse_only     = (known after apply)
      [32m+[0m[0m comment         = "Default external storage layer for 'dptest' data application."
      [32m+[0m[0m created_at      = (known after apply)
      [32m+[0m[0m created_by      = (known after apply)
      [32m+[0m[0m credential_id   = (known after apply)
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m fallback        = false
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-ext"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m updated_at      = (known after apply)
      [32m+[0m[0m updated_by      = (known after apply)
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-ext@mydlz01coreintstgext.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_raw[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_raw" {
      [32m+[0m[0m browse_only     = (known after apply)
      [32m+[0m[0m comment         = "Default raw storage layer for 'dptest' data application."
      [32m+[0m[0m created_at      = (known after apply)
      [32m+[0m[0m created_by      = (known after apply)
      [32m+[0m[0m credential_id   = (known after apply)
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m fallback        = false
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-raw"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m updated_at      = (known after apply)
      [32m+[0m[0m updated_by      = (known after apply)
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-raw@mydlz01coreintstgraw.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_external_location.external_location_workspace[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_workspace" {
      [32m+[0m[0m browse_only     = (known after apply)
      [32m+[0m[0m comment         = "Default workspace storage layer for 'dptest' data application."
      [32m+[0m[0m created_at      = (known after apply)
      [32m+[0m[0m created_by      = (known after apply)
      [32m+[0m[0m credential_id   = (known after apply)
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m fallback        = false
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-wks"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m updated_at      = (known after apply)
      [32m+[0m[0m updated_by      = (known after apply)
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-wks@mydlz01coreintstgwks.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_catalog_external_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_external_admin" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-admin"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_SCHEMA",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_catalog_external_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_external_developer" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-developer"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_catalog_external_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_external_reader" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-reader"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_catalog_external_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_external_service_principal" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_SCHEMA",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_catalog_internal_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_admin" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-admin"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_SCHEMA",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_catalog_internal_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_developer" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-developer"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_catalog_internal_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_reader" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-reader"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_catalog_internal_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_service_principal" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_SCHEMA",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_curated_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_curated_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_curated_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_curated_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_enriched_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_enriched_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_enriched_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_enriched_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_external_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_external_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_external_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_external_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_external_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_external_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_external_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_external_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_raw_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_raw_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_raw_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_raw_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_workspace_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_workspace_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_workspace_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_grant.grant_external_location_workspace_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permission_assignment.permission_assignment_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_permission_assignment" "permission_assignment_admin" {
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m permissions  = [
          [32m+[0m[0m "USER",
        ]
      [32m+[0m[0m principal_id = 408985471222074
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permissions.permissions_cluster_policy["DltComputePolicyPtt"][0m will be created
[0m  [32m+[0m[0m resource "databricks_permissions" "permissions_cluster_policy" {
      [32m+[0m[0m cluster_policy_id = "0003A319D0197D21"
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m object_type       = (known after apply)

      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_USE"
          [32m+[0m[0m service_principal_name = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-admin"
          [32m+[0m[0m permission_level       = "CAN_USE"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permissions.permissions_cluster_policy["JobComputePolicyPtt"][0m will be created
[0m  [32m+[0m[0m resource "databricks_permissions" "permissions_cluster_policy" {
      [32m+[0m[0m cluster_policy_id = "0008A8A232782ACA"
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m object_type       = (known after apply)

      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_USE"
          [32m+[0m[0m service_principal_name = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-admin"
          [32m+[0m[0m permission_level       = "CAN_USE"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permissions.permissions_cluster_policy["PersonalComputePolicyPtt"][0m will be created
[0m  [32m+[0m[0m resource "databricks_permissions" "permissions_cluster_policy" {
      [32m+[0m[0m cluster_policy_id = "0008C085051EFEDD"
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m object_type       = (known after apply)

      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_USE"
          [32m+[0m[0m service_principal_name = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-admin"
          [32m+[0m[0m permission_level       = "CAN_USE"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_permissions.permissions_directory[0m will be created
[0m  [32m+[0m[0m resource "databricks_permissions" "permissions_directory" {
      [32m+[0m[0m directory_path = "/mydlz01-dptest-int"
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m object_type    = (known after apply)

      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_MANAGE"
          [32m+[0m[0m service_principal_name = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-admin"
          [32m+[0m[0m permission_level       = "CAN_MANAGE"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-developer"
          [32m+[0m[0m permission_level       = "CAN_MANAGE"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-reader"
          [32m+[0m[0m permission_level       = "CAN_READ"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.databricksworkspaceapplication["dptest"].databricks_secret_acl.secret_acl_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_secret_acl" "secret_acl_admin" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m permission = "READ"
      [32m+[0m[0m principal  = "app001-admin"
      [32m+[0m[0m scope      = "mydlz01-dptest-int-secret-scope"
    }

[1m  # module.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001"
    }

[1m  # module.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_key_vault.key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_key_vault" "key_vault" {
      [33m~[0m[0m access_policy                   = [
          [31m-[0m[0m {
              [31m-[0m[0m certificate_permissions = []
              [31m-[0m[0m key_permissions         = []
              [31m-[0m[0m object_id               = "7f7c7b4a-704d-4531-b73e-45e16b388271"
              [31m-[0m[0m secret_permissions      = [
                  [31m-[0m[0m "Get",
                  [31m-[0m[0m "List",
                ]
              [31m-[0m[0m storage_permissions     = []
              [31m-[0m[0m tenant_id               = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ]
        id                              = "/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001"
        name                            = "mydlz01-dptest-prd-kv001"
        tags                            = {
            "costCenter" = "ABCD1234"
        }
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1mPlan:[0m 41 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>